export const backgroundLabels: any = {
  special_adoption: {
    originLabel:
      "お子さまが元のご家族で育てられなかった背景について、可能な範囲でお教えいただけますか？",
    originExample:
      "例: お子さまの生まれたご両親は、当時非常に若く、経済的にも精神的にも子育てが難しい状況でした。そのため、私たちは養子縁組を通じてお迎えすることになりました。",
    careLabel:
      "ご家族が特別養子縁組を選んだ経緯や、お子さまが家族の一員になった経緯や現在のお気持ちについて教えてください。",
    careExample:
      "例: 私たちは長い間子どもを望んでおり不妊治療も経験しましたが、年齢的にも厳しいことから、研修を受けて養親に登録しました。この子を受け入れてほしいと連絡があった日の喜びと興奮は忘れられません。初めての育児に戸惑うこともありますが、毎日が幸せです。",
  },
  foster_regular_adoption: {
    originLabel:
      "お子さまが元のご家族で育てられなかった理由について、教えていただけますか？",
    originExample:
      "例: お子さまの生まれたご両親は、家庭の事情で長期的に子育てができなくなり、私たちが里親としてお子さまを迎え入れることになりました。",
    careLabel:
      "里子・養子縁組を通じてどのようにしてご家族になられたのか、その過程を教えてください。",
    careExample:
      "例: 私たちは里親登録をして数年後、この子と出会いました。最初は短期間の里親の予定でしたが、1年以上一緒に生活することで大きくなるまで成長を見守りたいと思っています。",
  },
  sperm_donation: {
    originLabel:
      "精子提供に至った背景について、どのような経緯があったのかお聞かせください。",
    originExample:
      "例: 私たちは結婚当初から子どもを望んでいて不妊治療を行いましたが、無精子症のため自然妊娠が難しいという診断を受けました。夫婦で何度も議論を重ね、精子提供という選択肢を選ぶことにしました。",
    careLabel:
      "精子提供を経て、どのようにしてご家族が一緒に歩み始めたのか、その過程について教えてください。",
    careExample:
      "例: 出自を知る権利について懸念していましたが、非匿名のドナーに協力してもらうことができ、体外受精を経て無事に妊娠、この子が誕生しました。家族全員で一歩一歩、新しい生活に順応しながら、愛情を育んでいます。",
  },
  egg_donation: {
    originLabel:
      "卵子提供に至った背景について、どのような経緯があったのかお聞かせください。",
    originExample:
      "例: 体質的に自分の卵子で妊娠することが難しいと分かり、海外での卵子提供を受けることにしました。たくさん悩みましたが、自分で産みたいとの思いから、この方法で家族を作る決断をしました。",
    careLabel:
      "卵子提供を経て、どのようにしてご家族が一緒に歩み始めたのか、その過程について教えてください。",
    careExample:
      "例: 海外での卵子提供で不安もありましたが、卵子ドナーのおかげで無事に妊娠し、この子が誕生しました。妊娠中から「我が子」という思いが強かったので、普段は卵子提供ということもあまり意識せず、新しい生活を楽しんでいます。",
  },
  step_family: {
    originLabel:
      "ご家族がステップファミリーになった背景や、お子さまとの関係がどのように形作られたのか教えてください。",
    originExample:
      "例: 私とパートナーが再婚し、ステップファミリーとしての新しい生活が始まりました。最初は戸惑いもありましたが、お互いを理解し合いながら少しずつ絆を深めています。",
    careLabel:
      "ステップファミリーとしての新しい家族の形ができるまでの過程について、お教えいただけますか？",
    careExample:
      "例: 家族全員で時間をかけて互いの存在に慣れ、家族としての一体感が少しずつ築かれていきました。今では、笑顔と愛情にあふれた毎日を過ごしています。",
  },
  other: {
    originLabel:
      "お子さまが元のご家族で育てられなかった背景について、またご家族となるまでの特別な経緯について教えてください。",
    originExample:
      "例: 育てられなかった理由は複雑ですが、様々な事情が重なり、私たちが家族としてお迎えすることになりました。その過程で、たくさんの困難と向き合いましたが、今では新しい家族として幸せな日々を過ごしています。",
    careLabel:
      "その他の背景について、どのようにしてお子さまとご家族が一緒になったのか、その過程を教えてください。",
    careExample:
      "例: 最初はぎこちない部分もありましたが、家族全員で時間をかけて互いの存在に慣れ、家族としての一体感が少しずつ出てきました。今では、笑顔と愛情にあふれた毎日を過ごしています。",
  },
};
